## 修正症状名称 ##
import pandas as pd

# 读取文件
df = pd.read_csv('question_cleaned.csv')

# 定义替换映射
replace_dict = {
    '反食': '反流',
    '餐后反酸':'反酸',
    '口干舌燥': '口干或口苦',
    '口干': '口干或口苦',
    '口苦': '口干或口苦',
    '口干欲饮': '口干不欲饮',
    '呃逆': '嗳气',
    '大便干燥': '便干',
    '大便干结': '便干',
    '大便艰涩': '大便不畅',
    '排便不爽': '大便不畅',
    '排便困难': '大便不畅',
    '呕吐': '恶心或呕吐',
    '恶心': '恶心或呕吐',
    '呕吐物为胃内容物':'恶心或呕吐',
    '手足不温': '畏寒肢冷',
    '怕冷': '畏寒肢冷',
    '四肢不温': '畏寒肢冷',
    '疲乏': '神疲乏力',
    '乏力': '神疲乏力',
    '乏力懒言': '神疲乏力',
    '神疲乏力': '神疲乏力',
    '身倦乏力': '神疲乏力',
    '乏力明显':'神疲乏力',
    '胃脘隐痛喜温喜按': '喜温喜按',
    '腹中拘急冷痛，得温痛减': '喜温喜按',
    '腹中隐痛喜揉喜按': '喜温喜按',
    '痞闷': '胃痞胀',
    '痞满': '胃痞胀',
    '胃脘痞满':'胃痞胀',
    '胃痞胀满': '胃痞胀',
    '胃脘痞闷':'胃痞胀',
    '胃脘胀满':'胃痞胀',
    '胃脘胀痛':'胃脘痛',
    '胃脘隐痛':'胃脘痛',
    '胃脘灼痛': '胃脘痛',
    '胃脘疼痛': '胃脘痛',
    '胸胁满闷': '胸胁胀',
    '胸胁胀闷': '胸胁胀',
    '胸骨后梗阻感': '胸骨堵',
    '胸骨后灼痛': '胸骨痛',
    '胸骨后疼痛': '胸骨痛',
    '胸骨后疼痛不适': '胸骨痛',
    '脘腹疼痛': '腹痛',
    '腹中隐痛': '腹痛',
    '脘腹痞满': '腹胀',
    '腹部胀满不适': '腹胀',
    '饱胀': '腹胀',
    '矢气频': '矢气频繁',
    '不欲饮食': '纳呆',
    '食少':'纳呆',
    '食欲不振':'纳呆',
    '纳少':'纳呆',
    '面色少华': '面唇色淡',
    '面色少华，口唇色淡':'面唇色淡',
    '寐差':'失眠',
    '夜寐欠安':'失眠',
    '尿频':'尿频或尿急',
    '尿急':'尿频或尿急',
}

# 替换symptom列中的内容
df['symptom'] = df['symptom'].replace(replace_dict)

# 保存结果
df.to_csv('question_cleaned.csv', index=False)

# 统计替换情况
replaced_count = sum(df['symptom'].isin(replace_dict.values()))
print(f"处理后症状数统计：\n{df['symptom'].value_counts().head(10)}")